In [1]:
import numpy as np
import pandas as pd

In [2]:
from sklearn.model_selection import train_test_split as tts

In [5]:
dataset = 'iris_dataset.txt'

In [9]:
df = pd.read_csv(dataset, names = ['x1','x2','x3','x4','y'])

In [12]:
df.head()

    x1   x2   x3   x4            y
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [13]:
X = df.values[:,0:4]
Y = df.values[:,4]

In [18]:
X_train, X_test, Y_train, Y_test = tts(X,Y, test_size = 0.25, stratify = Y)

In [24]:
np.save('X_train',X_train)
np.save('Y_train',Y_train)
np.save('X_test',X_test)
np.save('Y_test',Y_test)

In [25]:
dataset = 'abalone_dataset.txt'

In [28]:
df = pd.read_csv(dataset,  names = ['y','x1','x2','x3','x4','x5','x6','x7','Age'])

In [29]:
df.head()

   y     x1     x2     x3      x4      x5      x6     x7  Age
0  M  0.455  0.365  0.095  0.5140  0.2245  0.1010  0.150   15
1  M  0.350  0.265  0.090  0.2255  0.0995  0.0485  0.070    7
2  F  0.530  0.420  0.135  0.6770  0.2565  0.1415  0.210    9
3  M  0.440  0.365  0.125  0.5160  0.2155  0.1140  0.155   10
4  I  0.330  0.255  0.080  0.2050  0.0895  0.0395  0.055    7

In [64]:
df2 = pd.get_dummies(df.drop(columns = ['Age']))

In [79]:
X = np.tile(df2.values, [2,1])
Y = np.tile(df['Age'].values,2)

In [81]:
Y.shape

(8354,)

In [83]:
X_train, X_test, Y_train, Y_test = tts(X,Y, test_size = 0.25, stratify = Y)

In [87]:
np.save('X_train',X_train)
np.save('Y_train',Y_train)
np.save('X_test',X_test)
np.save('Y_test',Y_test)

In [67]:
dataset = 'madelon_train.data'

In [68]:
df = pd.read_csv(dataset, sep = ' ', names = list(np.arange(0,501))).drop(500, axis = 1)

In [69]:
df.head()

,0,1,2,3,4,5,6,7,8,9,...,490,491,492,493,494,495,496,497,498,499
0,485,477,537,479,452,471,491,476,475,473,...,477,481,477,485,511,485,481,479,475,496
1,483,458,460,487,587,475,526,479,485,469,...,463,478,487,338,513,486,483,492,510,517
2,487,542,499,468,448,471,442,478,480,477,...,487,481,492,650,506,501,480,489,499,498
3,480,491,510,485,495,472,417,474,502,476,...,491,480,474,572,454,469,475,482,494,461
4,484,502,528,489,466,481,402,478,487,468,...,488,479,452,435,486,508,481,504,495,511

In [70]:
df.shape

(2000, 500)

In [71]:
df2 = pd.read_csv('madelon_train.labels', sep = ' ', names = 'c')

In [72]:
df2.head()

   c
0 -1
1 -1
2 -1
3  1
4  1

In [73]:
df2.shape

(2000, 1)

In [74]:
np.save('X_train', df.values)
np.save('Y_train', df2.values)

In [75]:
dataset = 'madelon_valid.data'

In [76]:
df = pd.read_csv(dataset, sep = ' ', names = list(np.arange(0,501))).drop(500, axis = 1)

In [77]:
df.head()

,0,1,2,3,4,5,6,7,8,9,...,490,491,492,493,494,495,496,497,498,499
0,483,454,513,495,523,469,453,477,506,479,...,455,480,543,259,413,520,485,498,523,510
1,485,508,493,487,478,472,504,476,479,475,...,486,480,535,534,514,452,484,495,548,477
2,483,521,507,475,493,486,421,475,496,483,...,491,476,498,495,508,528,486,465,508,503
3,474,504,576,480,553,483,524,478,483,483,...,521,475,470,463,509,525,479,467,552,517
4,495,474,523,479,495,488,485,476,497,478,...,510,471,522,343,509,520,475,493,506,491

In [78]:
df.shape

(600, 500)

In [79]:
df2 = pd.read_csv('valid_labels', sep = ' ', names = 'c')

In [80]:
df2.head()

   c
0 -1
1 -1
2 -1
3  1
4 -1

In [81]:
df2.shape

(600, 1)

In [82]:
np.save('X_test', df.values)
np.save('Y_test', df2.values)